# Задания 22.1
a = [10, 20]
b = a
b.append(30) # Добавь число 30 через b.
print("a:""\n", a)
b = [100, 200] # Создай новый список b, который будет содержать числа 100 и 200.
b.append(300) # Добавь число 300 через b.
print("a:""\n", a) # Выведи список a на экран.
print("b:""\n", b) # Выведи список b на экран.
# Задания 22.2
voltage = 380

def change_voltage(voltage):
    voltage = 220

change_voltage(voltage) # вызывает функцию (voltage = 220 переменная локальная, которая существует только внутри функции)
print(voltage) # Выведи значение переменной voltage на экран. (voltage = 380) это снаружи функции, глобальная переменная, которая существует в основном коде программы
# Задания 22.3
motor_a = {"name": "Конвейер", "status": "OFF"}
motor_b = motor_a
motor_b["status"] = "ON" # Измени статус мотора b на "ON".
motor_b = {"name": "Вытяжка", "status": "OFF"} # Создай новый словарь motor_b, который будет содержать имя "Вытяжка" и статус "OFF".
print("motor_a:""\n", motor_a) # Выведи словарь motor_a на экран.
print("motor_b:""\n", motor_b) # Выведи словарь motor_b